In [131]:
import pandas as pd
import numpy as np

# PREPROCESAMIENTO

In [132]:
df = pd.read_csv(r'data/ds_salaries.csv')

In [133]:
df.head(3)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S

In [134]:
df.columns #saber las columnas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [135]:
df.shape #Saber la dimensión de la matriz

(3755, 11)

In [136]:
df.dtypes #saber los tipos de datos

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [137]:
df.isnull().sum() #saber los valores nulos

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

Vamos a crear una funcion que nos permita saber la cantidad de datos repetidos que tenemos por coincidencia de indice

In [138]:
df.duplicated().sum()

np.int64(1171)

In [139]:
df[['work_year','experience_level','employment_type','job_title','salary','salary_currency','salary_in_usd','employee_residence','remote_ratio','company_location','company_size']].value_counts()

work_year  experience_level  employment_type  job_title           salary  salary_currency  salary_in_usd  employee_residence  remote_ratio  company_location  company_size
2022       SE                FT               Data Scientist      141525  USD              141525         US                  100           US                M               21
                                                                  191475  USD              191475         US                  100           US                M               21
2023       SE                FT               Data Engineer       252000  USD              252000         US                  0             US                M               13
                                                                  129000  USD              129000         US                  0             US                M               13
2022       SE                FT               Data Engineer       130000  USD              130000         US                  0             US                M               12
                                                                                                                                                                              ..
2020       EN                FT               Research Scientist  42000   USD              42000          NL                  50            NL                L                1
                             PT               Data Scientist      19000   EUR              21669          IT                  50            IT                S                1
                                              ML Engineer         14000   EUR              15966          DE                  100           DE                S                1
           EX                FT               Data Engineer       70000   EUR              79833          ES                  50            ES                L                1
           EN                FT               Data Analyst        72000   USD              72000          US                  100           US                L                1
Name: count, Length: 2584, dtype: int64

In [140]:
df.drop_duplicates(inplace=True)#Eliminar duplicados

In [141]:
df.shape

(2584, 11)

# EDA

In [142]:
df.head(1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L

¿Qué pais tiene más compañías de tamaño grande?

In [143]:
df.loc[df['company_size']=='L','company_location'].value_counts().head(1)

company_location
US    220
Name: count, dtype: int64

¿En qué puesto se gana más?

In [144]:
df.groupby ('salary_in_usd').max()['job_title'].max()

'Staff Data Scientist'

Tipo de trabajo, ¿pais de residencia dónde más se cobra?

In [169]:
df.groupby ('salary_in_usd').max()[['job_title','employee_residence']].reset_index().loc[::-1].reset_index(drop=True)

      salary_in_usd                           job_title employee_residence
0            450000                  Research Scientist                 US
1            430967                        Data Analyst                 GB
2            423834                        AI Scientist                 IL
3            423000  Applied Machine Learning Scientist                 US
4            416000            Principal Data Scientist                 US
...             ...                                 ...                ...
1030           5723                        Data Analyst                 IN
1031           5707             Data Science Consultant                 IN
1032           5679                      Data Scientist                 IN
1033           5409                  Power BI Developer                 IN
1034           5132                        NLP Engineer                 CZ

[1035 rows x 3 columns]

¿El nivel de  experiencia es proporcional al salario?